Revit 2027 API
PanelScheduleView.RemoveSpace Method
 Remove a space at specific cell.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSpace(
	int nRow,
	int nCol
)
Public Sub RemoveSpace (
	nRow As Integer,
	nCol As Integer
)
public:
void RemoveSpace(
	int nRow,
	int nCol
)
member RemoveSpace :
        nRow : int *
        nCol : int -> unit
Parameters
nRow Int32
 Row Number
nCol Int32
 Column Number
Exceptions
Exception | Condition
ArgumentsInconsistentException |  The row column combination does not represent a valid space.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace